Config/Catalogs/НачисленияСтудентамЗаПрочиеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НачисленияСтудентамЗаПрочиеУслуги</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазовоеНачисление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийНачисленияУчащимся</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/InformationRegisters/ПараметрыНачисленийЗаПрочиеУслугиСтудентам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыНачисленийЗаПрочиеУслугиСтудентам</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтавкаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиОплатыОбразование</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиОплатыОбразование</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НачислениеСтудентамЗаПрочиеУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НачисленияСтудентамЗаПрочиеУслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ВидыОперацийНачисленияУчащимся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийНачисленияУчащимся</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДолгосрочнымДоговорам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКраткосрочнымДоговорам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/НачисленияСтудентамЗаПрочиеУслуги/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		НачислениеСсылка = Справочники.НачисленияСтудентамЗаПрочиеУслуги.ПолучитьСсылку();
		
		ОбщегоНазначенияБГУ.ИнициализироватьЗаписьДляРедактированияВФорме(ЭтотОбъект,
			"ПараметрыНачисленийЗаПрочиеУслугиСтудентам", Новый Структура("НачислениеСтудентамЗаПрочиеУслуги", НачислениеСсылка));
		
		ПараметрыНачисленийЗаПрочиеУслугиСтудентам.Период = '19800101';
		
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЭлементов();
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.СтавкаНДС.Доступность = Объект.УчитыватьНДС;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	НачислениеСсылка = ТекущийОбъект.Ссылка;
	
	ОбщегоНазначенияБГУ.ПрочитатьЗаписьДляРедактированияВФорме(ЭтотОбъект,
		"ПараметрыНачисленийЗаПрочиеУслугиСтудентам", Новый Структура("НачислениеСтудентамЗаПрочиеУслуги", НачислениеСсылка));
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУКлиент.УстановитьРежимИзмененияРегистра(ЭтотОбъект, "ПараметрыНачисленийЗаПрочиеУслугиСтудентам");
	
	ПараметрыЗаписи.Вставить("ЭтоНовый", Объект.Ссылка.Пустая());
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Параметры.Ключ.Пустая() Тогда
		ТекущийОбъект.УстановитьСсылкуНового(НачислениеСсылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьПараметрыНачисленийЗаПрочиеУслугиСтудентам();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ ПараметрыЗаписи.ЭтоНовый Тогда
		
		ОбщегоНазначенияБГУ.ПрочитатьЗаписьДляРедактированияВФорме(ЭтотОбъект,
			"ПараметрыНачисленийЗаПрочиеУслугиСтудентам", Новый Структура("НачислениеСтудентамЗаПрочиеУслуги", НачислениеСсылка));
		
	КонецЕсли; 
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		ОбщегоНазначенияБГУ.ПроверитьЗаписьВФорме(ЭтотОбъект,
			"ПараметрыНачисленийЗаПрочиеУслугиСтудентам", Новый Структура("НачислениеСтудентамЗаПрочиеУслуги", НачислениеСсылка), Отказ);
		
		Если Объект.ВидНачисления = Перечисления.ВидыОперацийНачисленияУчащимся.ПоКраткосрочнымДоговорам
			И Не ЗначениеЗаполнено(ПараметрыНачисленийЗаПрочиеУслугиСтудентам.СтавкаОплаты) Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнена ставка оплаты!'"),,
				"ПараметрыНачисленийЗаПрочиеУслугиСтудентам.СтавкаОплаты",, Отказ);
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНачисленияПриИзменении(Элемент)
	
	ЭтоНачислениеПоДолгосрочнымДоговорам = ( Объект.ВидНачисления =
		ПредопределенноеЗначение("Перечисление.ВидыОперацийНачисленияУчащимся.ПоДолгосрочнымДоговорам") );
	Если ЭтоНачислениеПоДолгосрочнымДоговорам Тогда
		Объект.РазовоеНачисление = Ложь;
		ПараметрыНачисленийЗаПрочиеУслугиСтудентам.СтавкаОплаты = ПредопределенноеЗначение("Справочник.СтавкиОплатыОбразование.ПустаяСсылка");
	Иначе
		ПараметрыНачисленийЗаПрочиеУслугиСтудентам.ГрафикОплаты = ПредопределенноеЗначение("Справочник.ГрафикиОплатыОбразование.ПустаяСсылка");
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьИсторияНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НачислениеСтудентамЗаПрочиеУслуги", НачислениеСсылка);
	ОткрытьФорму("РегистрСведений.ПараметрыНачисленийЗаПрочиеУслугиСтудентам.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьНДСПриИзменении(Элемент)
	
	Элементы.СтавкаНДС.Доступность = Объект.УчитыватьНДС;
	Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьПараметрыНачисленийЗаПрочиеУслугиСтудентам()
	
	ВедущиеОбъекты = Новый Структура("НачислениеСтудентамЗаПрочиеУслуги", НачислениеСсылка);
	ОбщегоНазначенияБГУ.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтаФорма, "ПараметрыНачисленийЗаПрочиеУслугиСтудентам", ВедущиеОбъекты);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"НадписьИстория", "Доступность", НЕ Объект.Ссылка.Пустая());
	
	ЭтоНачислениеПоДолгосрочнымДоговорам = (Объект.ВидНачисления = Перечисления.ВидыОперацийНачисленияУчащимся.ПоДолгосрочнымДоговорам);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"РазовоеНачисление", "Доступность", Не ЭтоНачислениеПоДолгосрочнымДоговорам);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ПараметрыНачисленийЗаПрочиеУслугиСтудентамСтавкаОплаты", "Видимость", Не ЭтоНачислениеПоДолгосрочнымДоговорам);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ПараметрыНачисленийЗаПрочиеУслугиСтудентамГрафикОплаты", "Видимость", ЭтоНачислениеПоДолгосрочнымДоговорам);
	
КонецПроцедуры

#КонецОбласти
